#include <string>
#include <map>
#include "Translate.hpp"

std::map<std::string, int> chooseMap(std::string lang) {
    std::map<std::string, int> m;
    if (lang == "rus") {
        m = {{"А",0}, {"Б",1}, {"В",2}, {"Г",3}, {"Д",4}, {"Е",5}, {"Ж",6}, {"З",7}, {"И",8},
         {"К",9}, {"Л",10}, {"М",11}, {"Н",12}, {"О",13}, {"П",14}, {"Р",15}, {"С",16}, {"Т",17}, {"У",18}, {"Ф",19}, {"Х",20}, {"Ц",21}, {"Ч",22},
          {"Ш",23}, {"Щ",24}, {"Ы",25}, {"Ъ",26}, {"Ь",27}, {"Э",28}, {"Ю",29}, {"Я",30}};
    }
    if (lang == "eng") {
        m = {{"A",0}, {"B",1}, {"C",2}, {"D",3}, {"E",4}, {"F",5}, {"G",6}, {"H",7}, {"I",8}, {"J",9},
        {"K",10}, {"L",11}, {"M",12}, {"N",13}, {"O",14}, {"P",15}, {"Q",16}, {"R",17}, {"S",18}, {"T",19},
        {"U",20}, {"V",21}, {"W",22}, {"X",23}, {"Y",24}, {"Z",25}, {" ",26}};
    }
    return m;
}

std::map<int, std::string> chooseUnMap(std::string lang) {
    std::map<int, std::string> m;
    if (lang == "rus") {
        m = {{0,"А"}, {1,"Б"}, {2,"В"}, {3,"Г"}, {4,"Д"}, {5,"Е"}, {6,"Ж"}, {7,"З"}, {8,"И"}, {9,"К"},
         {10,"Л"}, {11,"М"}, {12,"Н"}, {13,"О"}, {14,"П"}, {15,"Р"}, {16,"С"}, {17,"Т"}, {18,"У"}, {19,"Ф"}, {20,"Х"},
          {21,"Ц"}, {22,"Ч"}, {23,"Ш"}, {24,"Щ"}, {25,"Ы"}, {26,"Ъ"}, {27,"Ь"}, {28,"Э"}, {29,"Ю"}, {30,"Я"}};
    }
    if (lang == "eng") {
        m = {{0,"A"}, {1,"B"}, {2,"C"}, {3,"D"}, {4,"E"}, {5,"F"}, {6,"G"}, {7,"H"}, {8,"I"}, {9,"J"},
        {10,"K"}, {11,"L"}, {12,"M"}, {13,"N"}, {14,"O"}, {15,"P"}, {16,"Q"}, {17,"R"}, {18,"S"}, {19,"T"},
        {20,"U"}, {21,"V"}, {22,"W"}, {23,"X"}, {24,"Y"}, {25,"Z"}, {26, " "}};
    }
    return m;
}

int translate(std::string a, std::string lang) {
    static std::map<std::string, int> m = chooseMap(lang);
    return m.at(a);
}

std::string untranslate(int a, std::string lang) {
    static std::map<int, std::string> k = chooseUnMap(lang);
    return k.at(a);
}